src/InformationRegisters/ПредпочтенияКлиентовПоМастерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПредпочтенияКлиентовПоМастерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПредпочтенияКлиентовПоМастерам/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет установку последнего мастера, обслуживавщего клиента
//
Процедура УстановитьПредпочитаемогоМастера(мПараметры) Экспорт
	
	Если ТипЗнч(мПараметры.Сотрудники) = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаСотрудник из мПараметры.Сотрудники Цикл
			НаборЗаписей = РегистрыСведений.ПредпочтенияКлиентовПоМастерам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(СтрокаСотрудник.Контрагент);
			НаборЗаписей.Отбор.Должность.Установить(СтрокаСотрудник.Сотрудник.Должность);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(мПараметры.СтруктурнаяЕдиница);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Контрагент = СтрокаСотрудник.Контрагент;
			НоваяЗапись.Должность  = СтрокаСотрудник.Сотрудник.Должность;
			НоваяЗапись.Сотрудник  = СтрокаСотрудник.Сотрудник;
			НоваяЗапись.СтруктурнаяЕдиница = мПараметры.СтруктурнаяЕдиница; 
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаСотрудник из мПараметры.Сотрудники Цикл
			НаборЗаписей = РегистрыСведений.ПредпочтенияКлиентовПоМастерам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(мПараметры.Контрагент);
			НаборЗаписей.Отбор.Должность.Установить(СтрокаСотрудник.Должность);
			НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(мПараметры.СтруктурнаяЕдиница);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Контрагент = мПараметры.Контрагент;
			НоваяЗапись.Должность  = СтрокаСотрудник.Должность;
			НоваяЗапись.Сотрудник  = СтрокаСотрудник;
			НоваяЗапись.СтруктурнаяЕдиница = мПараметры.СтруктурнаяЕдиница; 
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
